# Автор Ігор Хруневич
# Цю міні-програму створено, щоб зацікавити дітей програмуванням
# Користуйтесь, вивчайте, досліджуйте, змінюйте - експериментуйте

from math import sqrt, pi
import turtle

print("Розрахуйте S площу круга")

r = float(input("Введіть радіус кола R ? = "))
print ("S круга = Пі(3.14)*(R в квадраті)")
print("Площа: %.2f" % (pi * r ** 2))
turtle.left(90)
turtle.circle(r*37)
print ("Поки Ви звіряєте свій розв'язок із розв'язком даної програми, черепашка намалювала Вам ваш круг. Знайдіть його у себе на моніторі.")

